package com.example.lab1_android_demchenko
import kotlinx.parcelize.Parcelize
import android.os.Parcelable
@Parcelize
public final data class Cat(
    val txtopcat2: String = "КІТ",
    val txdowncat2: String = "Рід хижих ссавців родини котових  ",
    val extended_text_cat2: String = " У деяких старіших системах класифікації до нього зараховували всіх представників малих кішок (Felinae), проте зараз безпосередньо до роду відносяться лише кілька видів невеликих тварин, що мешкають у Євразії та Африці.\n" +
            "\n" +
            "Найвідомішим представником цього роду є свійський кіт — підвид кота лісового.\n" +
            "\n" +
            "За розміром найменшим представником роду є вид мураховий тигр довжина тіла і голови якого становить від 38 до 44 см. Найбільшим є кіт очеретяний із довжиною тіла і голови від 62 до 76 см[4]. Види котів (Felis) мешкають у широкому різновиді природних середовищ, від болотяних до пустель, і харчуються здебільшого малими мишоподібними, птахами й іншими дрібними тваринами.\n" +
            "\n" +
            "Генетичні дослідження показують, що Кіт (Felis), Манул (Otocolobus) і Азійський кіт (Prionailurus) походять від Євразійського прародителя, що існував близько 6,2 мільйонів років тому, і що види Котів розділилися від 3,04 до 0.99 мільйонів років тому[5][6]."

) : Parcelable