package com.example.lab1_android_demchenko

import kotlinx.parcelize.Parcelize
import android.os.Parcelable
@Parcelize
public final data class Lion(
    val txtoplion2: String = "ЛЕВ",
    val txdownlion2: String = " Вид хижих ссавців з роду пантер родини котових ",
    val extended_text_lion2: String = "Це другий за величиною вид родини після тигра. " +
            "Самці, які впізнавані за гривою, мають вагу від 150 до 250 кг; натомість самиці важать від 120 до " +
            "150 кг. Сучасний ареал фрагментований, лежить на південь від Сахари, також є одна невелика популяція " +
            "на північному заході Індії. У дикій природі леви максимальна тривалість життя становить 14 років, у" +
            " неволі — 30 років. На відміну від інших видів котів, леви є соціальними. Група левиць зазвичай полює" +
            " разом, нападаючи на великих копитних. Лев є вразливим видом, оскільки вважається, що популяція левів " +
            "зазнала зменшення приблизно на 43% за 21 рік (приблизно три покоління левів, 1993–2014). Найбільшими" +
            " причинами зменшення чисельності левів є втрата середовища проживання та зіткнення з людиною. Лев як" +
            " символ широко представлений у людській культурі; він зображений у скульптурах та картинах, гербах, " +
            "фільмах та літературі."

) : Parcelable